Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape
General shapes for structural sections.
Since:
2018
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape.GeneralLZ
Defines parameters for Z Cold Formed structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape.GeneralCEx
Defines parameters for Channel With Fold Cold Formed structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape.GeneralF
Defines parameters for Flat Bar structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape.GeneralR
Defines parameters for Pipe structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape.GeneralS
Defines parameters for Round Bar structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape.GeneralH
Defines parameters for Rectangular Pipe structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape.GeneralT
Defines parameters for Tees structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape.GeneralW
Defines parameters for Angle structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape.GeneralLA
Defines parameters for Angle Cold Formed structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape.GeneralU
Defines parameters for Channel structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape.GeneralC
Defines parameters for Channel Cold Formed structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape.GeneralI
Defines parameters for Double T structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralShape.NotDefined
General shape is not defined.